[
    {
        "Введение": [
            "Цель проекта: создание веб-системы, предназначенной для постинга собственных статей, блогов, интересных историй и прочего. Система включает в себя веб-сайт и мобильное приложение, что позволяет организовать универсальный доступ для любого пользователя. Также, благодаря различным фильтрам и поиску по статьям, ресурс предлагает удобные возможности для обсуждения и оценивания работ. На реализацию данного проекта выделено полгода, бюджет составляет 550 тыс. рублей. К критичным требованиям можно отнести достаточные ресурсы для хранения всех статей, интеграцию с другими системами (например, логин через сторонние сервисы), разработку приятного и удобного интерфейса."
        ]
    },
    {
        "Организация выполнения": [
            "Проектирование данной системы предполагает команду программистов, выбранных по следующим критериям: знание и опыт работы с технологиями PostgreSQL, Ruby, знание HTML, CSS и фреймворка AngularJS, а также – опыт работы в команде. Команда будет включать в себя 7 человек: руководителя проекта, тимлида, два веб-программиста, 2 тестировщика и дизайнера."
        ]
    },
    {
        "Анализ рисков": [
            "Нехватка ресурсов или бюджета",
            "Нарушение графика разработки",
            "Непредвиденные обстоятельства",
            "Вынужденные изменения стека технологий (потеря актуальности)",
            "Технические проблемы при реализации функционала"
        ]
    },
    {
        "Необходимые ресурсы": [
            "База данных",
            "Хостинг с виртуальной машиной, сервер для этапов разработки и тестирования раннего функционала",
            "Домен для браузерного клиента"
        ]
    },
    {
        "Основные этапы и вехи": [
            {
                "Этапы": [
                    "1 этап – проектирование веб-системы- 45 дней",
                    "Проектирование серверной логики",
                    "Проектирование базы данных",
                    "Проектирование интерфейсов для всех платформ",
                    "2 этап – реализация базовой системы- 45 дней",
                    "Реализация серверной логики",
                    "Реализация базы данных",
                    "3 этап – реализация клиента - 45 дней",
                    "Реализация пользовательского клиента для веб-браузера",
                    "Реализация пользовательского клиента для мобильного приложения",
                    "4 этап – разработка дизайна - 45 дней",
                    "Разработка дизайна для веб-клиента",
                    "Разработка дизайна для мобильного клиента",
                    "5 этап – тестирование текущей версии функционала- 30 дней",
                    "Тестирование взаимодействия клиентов с базой данных",
                    "Тестирование разработанных функций",
                    "6 этап –интеграция с внешними системами, доработка- 30 дней",
                    "Реализация логина с помощью внешних систем",
                    "Реализация репостинга во внешние системы",
                    "Доработка веб и мобильной версии клиента",
                    "7 этап – финальное тестирование - 20 дней",
                    "Бета-тест веб-версии и мобильного приложения, выявление и устранение ошибок/недостатков",
                    "Тестирование взаимодействия веб и мобильной версии",
                    "8 этап – запуск - 10 дней",
                    "Развертывание сервиса",
                    "Релиз"
                ]
            },
            {
                "Вехи": [
                    "Спроектирована веб-система (45 дней от начала разработки проекта)",
                    "Реализована серверная логика и база данных системы (45 дней от начала разработки проекта)",
                    "Реализованы пользовательские клиенты для веб и мобильного приложения (90 дней от начала разработки проекта)",
                    "Разработан дизайн для веб и мобильного клиента (90 дней от начала разработки проекта)",
                    "Проведен этап тестирования текущего функционала (120 дней от начала разработки проекта)",
                    "Реализована интеграция с внешними система (150 дней от начала разработки проекта)",
                    "Проведено финальное тестирование (170 дней от начала разработки проекта)",
                    "Произведен релиз проекта (180 дней от начала разработки проекта)"
                ]
            }
        ]
    },
    {
        "График работ": [
            "1–2 этап (начинаются одновременно) – 45 дней. Задействованы руководитель проекта, тимлид, 2 веб-программиста.",
            "3–4 этап (начинаются одновременно) – 45 дней. Задействованы тимлид, 2 веб-программиста и дизайнер.",
            "5 этап – 30 дней. Задействованы руководитель проекта, тимлид, 1 веб-программист и 2 тестировщика.",
            "6 этап – 30 дней. Задействованы 2 веб-программиста, дизайнер, 1 тестировщик.",
            "7 этап – 20 дней. Задействованы руководитель, тимлид, 2 веб-программиста, 2 тестировщика.",
            "8 этап – 10 дней. Задействованы руководитель, тимлид, 2 веб-программиста."
        ]
    },
    {
        "Механизмы мониторинга и контроля": [
            "В начале каждой недели – инструктаж, постановка задачи, разделение на подзадачи. Среди недели могут быть небольшие собрания для обсуждения возможных новых идей и выделения уже выполненных задач. В конце каждой недели – отчет о результатах. В конце каждого этапа – отчеты о результатах."
        ]
    }
]